# ✔ Создайте вручную список с повторяющимися целыми числами.
# ✔ Сформируйте список с порядковыми номерами
# нечётных элементов исходного списка.
# ✔ Нумерация начинается с единицы.

list_inp = [1, 2, 3, 5, 4, 6, 8, 7, 8, 9, 5, 4, 6, 1, 4, 3, 3, 3, 5, 3, 7, 4, 4, 5, 3, 2, 5, 4, 5, 9, 7, 8, 9, 4, 1, 3]
numerator = []
for i in range(len(list_inp)):
    if list_inp[i] % 2 != 0:
        numerator.append(i + 1)

print(numerator)

# ============================

sample_list = [1, 2, 1, 1, 2, 4, 4]

for i, item in enumerate(sample_list, 1):
    if item % 2:
        print(i, end=' ')
